//=================================================================================================
//
//	キャラセレ
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Game.h"
#include "../90_GameMain/Scene.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{

	class CharaSele	: public Scene, public std::enable_shared_from_this < CharaSele >
	{
		P_Grp		m_bg;

	public:
		CharaSele ();
		CharaSele ( const CharaSele & rhs ) = delete;
		~CharaSele ();

		void ParamInit ();
		void Load ();

		P_GameScene Transit ();
	};

	using P_CharaSele = std::shared_ptr < CharaSele >;


}	//namespace GAME

