//=================================================================================================
//
//	Menu
//		GameMenuをベースに、ゲーム内で使用するメニュを定義するファイル
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Game.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{

	//=================================================
	//メニュ 項目
	class MenuItem : public GameMenuItem
	{
	public:
		MenuItem ();
		MenuItem ( const MenuItem & rhs ) = delete;
		~MenuItem ();
	};

	using P_MenuItem = std::shared_ptr < MenuItem >;
	using VP_MenuItem = std::vector < P_MenuItem >;


	//=================================================
	//メニュ 動作主体
	class Menu :  public GameMenu
	{
	public:
		Menu ();
		Menu ( const Menu & rhs ) = delete;
		~Menu ();

	};

	using P_Menu = std::shared_ptr < Menu >;


}	//namespace GAME

