//=================================================================================================
//
//	TestMenuMain
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "TestMenuMain.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	TestMenuMain::TestMenuMain ()
	{
		m_bg = std::make_shared < GameGraphic >();
		m_bg->AddTexture ( U"test_BG_school.png" );
		AddpTask ( m_bg );
		GRPLST_INSERT ( m_bg );

		m_menu = std::make_shared < TestMenu >();
		AddpTask ( m_menu );
	}

	TestMenuMain::~TestMenuMain ()
	{
	}

	void TestMenuMain::Load ()
	{
		TASK_VEC::Load ();
	}

	void TestMenuMain::Move ()
	{
		TASK_VEC::Move ();
	}


}	//namespace GAME

