//=================================================================================================
//
// DebugDisp 
//		デバッグ表示を切換
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
//	インクルードファイル
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
//	定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{


//====================================================
//ゲーム内ウィンドウへのデバッグ表示切替
//	0 : OFF
//  1 : ON

#define DEBUG_DISP	0

extern const bool g_bDEBUG_DISP;

#if 0
		//使用例
		
		//デバッグ表示あり
		//DBGOUT_WND_F は　ExeChara中で用いると２P側で上書きされる
//		if ( m_btlPrm.GetPlayerID () == PLAYER_ID_1 )
		{
			DBGOUT_WND_F ( DBGOUT_6, U"OperateEffect::m_bGenerate{}"_fmt( m_bGenerate ) );
		}
#endif // 0
//====================================================


//====================================================
//デバッグ用コマンドプロンプト表示切替
//	0 : OFF
//  1 : ON

#define CMDPRMPT_DISP	0
extern const bool g_bCMDPRMPT_DISP;

#if 0
	//使用例
	DebugOutPrint::OpenPrompt ();
	std::cout << s3d::String ( U"start DebugOutPrint." ) << std::endl;
	PRINT_F_S ( U"start DebugOutPrint.\n" );

#endif // 0
//====================================================


//====================================================
//開始時　一時停止スタート　切替
// 		[w]で手動切替
//	0 : OFF
//  1 : ON

#define WAIT_START	0
extern const bool g_bWAIT_START;

//====================================================



//====================================================
// 	   体験版切替
//	0 : OFF
//  1 : ON

#define TRIAL	0
extern const bool g_bTRIAL;


//====================================================

}

