//=================================================================================================
//
//	Compend
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Compend.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	Compend::Compend()
	{
	}

	Compend::~Compend()
	{
	}

	void Compend::SetpSqc ( UP_AP_Sqc papSqc )
	{
		size_t size = papSqc->size ();
		mpap_Sqc->clear ();
		mpap_Sqc->resize ( size );
		for ( size_t i = 0; i < size; ++ i )
		{
			(*mpap_Sqc) [ i ] = (*papSqc) [ i ];
		}
	}

	bool Compend::ExistSqc ( const s3d::String & name ) const
	{
		for ( auto p : * mpap_Sqc )
		{
			const s3d::String & actionName = p->Name.Get();
			if ( 0 == name.compare ( actionName ) )
			{
				return T;
			}
		}
		return F;
	}


}	//namespace GAME

