//=================================================================================================
//
//	Sequence ソースファイル
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Sequence.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{

	Sequence::Sequence ()
	{
		m_papFrame = std::make_shared < AP_Frame > ();
	}

	Sequence::~Sequence ()
	{
		Rele();
	}

	void Sequence::Rele ()
	{
		for ( P_Frame p : *m_papFrame) { p->Rele (); }
		m_papFrame->clear ();
	}

	void Sequence::AddaFrame( UP_AP_Script arypFrame, rsize_t size )
	{
		m_papFrame->clear ();
		m_papFrame->resize ( size );
		for ( UINT i = 0; i < size; ++ i )
		{
			( *m_papFrame) [ i ] = arypFrame[ i ];
		}
	}

}	//namespace GAME

