//=================================================================================================
//
// DebugDisp ソースファイル
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Game.h"
#include "00_Core/DebugDisp.h"


//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//extern 実体


	//====================================================
	//バージョン表記
	s3d::String g_VERSION = U"ver 0.74";

#if 0
//	ver 0.74	2026/08/  ( ) 大幅修正
//	ver 0.73	2026/07/12(日) 不具合修正
//	ver 0.72	2026/07/11(土) レイナ2Pカラー＋その他色々
//	ver 0.71	2026/06/13(土) 主にレイナの調整＋その他色々
//	ver 0.70	2026/06/07(日) 新キャラクター「レイナ」追加
//	--------------------------------------------------------------
//	ver 0.67	2026/04/30(木) EVOJ前修正の修正
//	ver 0.66	2026/04/24(金) EVOJ前修正
//	ver 0.65	2026/04/19(日) 修正
//	ver 0.64	2026/04/08(水) 月日星カラー追加＋修正
//	ver 0.63	2026/04/04(土) 修正
//	ver 0.62	2026/04/01(水) 月日星ボイス追加＋修正
//	ver 0.61	2026/03/20(金) リザルト修正
//	ver 0.60	2026/03/19(木) 「月日星」プレイアブル
//	--------------------------------------------------------------
//	ver 0.56	2026/02/22(日) ごちゃまぜゲーム会 + 修正
//	ver 0.55	2026/01/13(火) ２ラウンド同時取得バグ修正
//	ver 0.54	2026/01/04(日) ごちゃまぜゲーム会 + 修正
//	ver 0.53	2025/12/12(金) 修正
//	ver 0.52	2025/12/04(木) 修正
//	ver 0.51	2025/11/25(火) デジゲー博2025 + 修正
//	ver 0.50	2025/11/09(日) デジゲー博2025
//	--------------------------------------------------------------
//	ver 0.25	2025/04/26(土) ガード修正版
//	ver 0.24	2025/04/20(日) バトル修正版
//	ver 0.23	2025/02/22(土) 修正版
//	ver 0.22	2025/02/10(日) Steam対応開始に合わせた修正版
//	ver 0.21	2025/01/26(日) バトルアップデート版
//	--------------------------------------------------------------
//	ver 0.20	2024/12/30(月) コミックマーケット105 (2024冬コミ) 公開
//	ver 0.15	2024/12/15(日) 変な格ゲー会 ロケテスト
//	ver 0.12	2024/11/	　 バグ修正
//	ver 0.10	2024/11/03(日) デジゲー博2024 公開
#endif // 0


	//バージョン初期化（日付＋時刻）
	void InitVersion ( const char* DATE, const char* TIME )
	{
#define BETA_DATE_TIME 1
#if BETA_DATE_TIME

		//std::ostringstream oss;
		//oss << "beta " << __DATE__ << " " << __TIME__;
		//g_VERSION.assign ( s3d::Unicode::FromUTF8 ( oss.str ().c_str () ) );
		DBGOUT_WND ()->DebugOutWnd_Build_Time ( DATE, TIME );
#else
		( void ) DATE;
		( void ) TIME;
#endif // BETA_DATE_TIME
	}

	//====================================================




//デバッグ表示切替
#define G_DEBUG_FLAG	1



#if G_DEBUG_FLAG

	//ゲーム内ウィンドウへのデバッグ表示切替
	const bool g_bDEBUG_DISP = T;

	//デバッグ用コマンドプロンプト表示切替
	const bool g_bCMDPRMPT_DISP = T;

	//タイトル画面で全キャラ読込
	//const bool g_bALL_CHARA_LOAD_IN_TITLE = F;
	const bool g_bALL_CHARA_LOAD_IN_TITLE = T;

	//カーソル位置のモニタの中心から開始
	const bool g_bSTART_CURSOR_POS = T;

#else
	const bool g_bDEBUG_DISP = F;
	const bool g_bCMDPRMPT_DISP = F;
	const bool g_bALL_CHARA_LOAD_IN_TITLE = T;
	const bool g_bSTART_CURSOR_POS = F;

#endif // G_DEBUG_FLAG

#if 0

	//====================================================
	//ゲーム内ウィンドウへのデバッグ表示切替

//	const bool g_bDEBUG_DISP = T;
	const bool g_bDEBUG_DISP = F;
	//====================================================


	//====================================================
	//デバッグ用コマンドプロンプト表示切替

//	const bool g_bCMDPRMPT_DISP = T;
	const bool g_bCMDPRMPT_DISP = F;
	//====================================================


	//====================================================
	//タイトル画面で全キャラ読込

//	const bool g_bALL_CHARA_LOAD_IN_TITLE = T;
	const bool g_bALL_CHARA_LOAD_IN_TITLE = F;
	//====================================================


	//====================================================
	//カーソル位置のモニタの中心から開始

//	const bool g_bSTART_CURSOR_POS = T;
	const bool g_bSTART_CURSOR_POS = F;
	//====================================================

#endif // 0


	//====================================================
	//開始時　一時停止スタート　切替

//	const bool g_bWAIT_START = T;
	const bool g_bWAIT_START = F;
	//====================================================


	//====================================================
	//体験版切替

//	const bool g_bTRIAL = T;
	const bool g_bTRIAL = F;
	//====================================================


}	//namespace GAME

