//=================================================================================================
//
// シーンマネージャ ヘッダ
//		ゲームシーンを管理
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Game.h"
#include "00_Core/Scene_lib.h"
#include "00_Core/Param.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//==================================================================
	//ゲーム状態遷移管理
	class SceneManager_lib	: public GameSceneManager
	{
		P_Param		m_pParam;	//シーン共通パラメータ

	public:
		SceneManager_lib ();
		SceneManager_lib ( const SceneManager_lib& rhs ) = delete;
		~SceneManager_lib ();

		void Load ();
		void Start ();
		void Move ();

		//シーン共通パラメータ
		void SetpParam ( P_Param&& pParam ) { m_pParam = std::move ( pParam ); }
		P_Param GetpParam () { return m_pParam; }
	};

	//==================================================================


}	//namespace GAME

