//=================================================================================================
//
//	Sequence ソースファイル
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "10_CharaData/Sequence.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace CHARA
{

	Sequence::Sequence ()
	{
		m_papFrame = std::make_shared < AP_Frame > ();
	}

	Sequence::~Sequence ()
	{
		Rele();
	}

	void Sequence::Rele ()
	{
		for ( P_Frame p : *m_papFrame) { p->Rele (); }
		m_papFrame->clear ();
	}

	void Sequence::AddaFrame ( UP_AP_Frame paFrm )
	{
		size_t size = paFrm->size ();
		m_papFrame->clear ();
		m_papFrame->resize ( size );
		for ( size_t i = 0; i < size; ++ i )
		{
			(*m_papFrame) [ i ] = (*paFrm) [ i ];
		}
	}

}	//namespace CHARA

