//=================================================================================================
//
//	CharaSele_Actor
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Game.h"

//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{

	class CharaSele_Actor	: public TASK_VEC, public std::enable_shared_from_this < CharaSele_Actor >
	{

	public:
		CharaSele_Actor ();
		CharaSele_Actor ( const CharaSele_Actor & rhs ) = delete;
		~CharaSele_Actor ();

		void Load ();
	};

	using P_CharaSele_Actor = std::shared_ptr < CharaSele_Actor >;


}	//namespace GAME

