//=================================================================================================
//
//	PauseMenu_Const
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Game.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//--------------------------------------
	//メニュ 描画Z位置(後:1.f ～ 0.0f:前)

	//@info 大きい方が奥
	extern const float Z_MENU_BG		;
	extern const float Z_MENU_STR		;
	extern const float Z_MENU_YN_BG	;
	extern const float Z_MENU_YN_STR	;
	extern const float Z_MENU_KI_BG	;
	extern const float Z_MENU_KI_STR	;
	//@info 小さい方が手前

	//--------------------------------------

	constexpr float MENU_BG_W = 1000;
	constexpr float MENU_BG_H = 800;
	constexpr float MENU_BG_X = 1280 / 2 - MENU_BG_W / 2;
	constexpr float MENU_BG_Y = 960 / 2 - MENU_BG_H / 2 ;


}	//namespace GAME

