//=================================================================================================
//
//	EfHitLine ヘッダファイル
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Game.h"
//#include "../../90_GameMain/GameConst.h"
#include "00_Core/FtgConst.h"
#include "../ExeChara/BtlParam.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//ヒットエフェクトクラス
	class EfHitLine : public GrpEf
	{

	public:
		EfHitLine ();
		EfHitLine ( const EfHitLine & rhs ) = delete;
		~EfHitLine ();

		void Init ();
		void Move ();
	};

	using P_EfHitLine = std::shared_ptr < EfHitLine >;

}	//namespace GAME


