//=================================================================================================
//
//	Branch ヘッダファイル
//		スクリプト遷移条件の入力コマンドと遷移先シークエンス
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
//#include "Game.h"
#include "Define.h"
#include "Chara_Const.h"
#include "Command.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//---------------------------------------------------------------
	//前方宣言
	class Sequence;
	using WP_Sqc = std::weak_ptr < Sequence >;		//循環参照


	//---------------------------------------------------------------
	class Branch
	{
		s3d::String		m_name;				//名前
		BRANCH_CONDITION		m_condition;	//分岐条件

		UINT		m_indexCommand;		//条件コマンド配列添字
		s3d::String m_nameCommand{ U"cmd_name" };	//条件コマンド名前
		WP_Command	m_pCommand;			//条件コマンドポインタ

		UINT		m_indexSequence;	//遷移先シークエンス添字
		s3d::String	m_nameSequence{ U"sqc_name" };	//遷移先シークエンス名前
		WP_Sqc		m_pSequence;		//遷移先シークエンスポインタ

		UINT		m_indexFrame;		//遷移先スクリプト位置
		bool		m_ohter;			//同一シークエンスで遷移可能かどうか

	public:
		Branch();
		Branch( const Branch& rhs ) = delete;
		~Branch();

		void Load ();
	};

	using P_Branch = std::shared_ptr < Branch >;


}	//namespace GAME

