//=================================================================================================
//
//	Compend ヘッダ
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Define_Siv3D.h"
#include "Sequence.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{

	class Compend
	{
		PAP_Tx		mpap_txMain;	//イメージ テクスチャ配列
		PAP_Sqc		mpap_Sqc;		//シークエンス配列

		PAP_Adi		mpap_VC;		//ボイス
		PAP_Adi		mpap_SE;		//SE

	public:
		Compend ();
		Compend( const Compend& rhs ) = delete;
		~Compend ();

		void SetpSqc ( UP_AP_Sqc papSqc );
	};

	using P_CCompend = std::shared_ptr < Compend >;


}	//namespace GAME

