//=================================================================================================
//
//	Prm_Result
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Prm_Result.h"
#include "../03_FtgMain/FtgConst.h"


//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	Prm_Result::Prm_Result ()
	{
	}

	Prm_Result::Prm_Result ( const Prm_Result & rhs )
	{
	}

	Prm_Result::~Prm_Result ()
	{
	}


	void Prm_Result::Load ()
	{
	}

	void Prm_Result::Reset ()
	{
		m_winner = PLAYER_ID_1;		//勝者
		m_n_life_1p = LIFE_START;	//残ライフ
		m_n_life_2p = LIFE_START;	//
		m_n_input_1p = 0;			//入力数
		m_n_input_2p = 0;			//
		m_n_act_1p = 0;				//アクション回数
		m_n_act_2p = 0;				//
		m_n_offset = 0;				//相殺数
		m_n_max_chain_1p = 0;		//連撃数
		m_n_max_chain_2p = 0;		//
		m_n_max_damege_1p = 0;		//最大連撃力
		m_n_max_damege_2p = 0;		//
	}



}	//namespace GAME

