//=================================================================================================
//
//	パラメータ　キャラ
//		事前読込やカラー指定のため保持するポインタ類
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Game.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	
	//-----------------------------------------
	//リザルト用データ
	class Prm_Result
	{

		//リザルト用
		PLAYER_ID		m_winner { PLAYER_ID_1 };		//勝者
		int32		m_n_life_1p { 0 };		//残ライフ
		int32		m_n_life_2p { 0 };		//
		int32		m_n_input_1p { 0 };		//入力数
		int32		m_n_input_2p { 0 };		//
		int32		m_n_act_1p { 0 };		//アクション回数
		int32		m_n_act_2p { 0 };		//
		int32		m_n_offset { 0 };		//相殺数
		int32		m_n_max_chain_1p { 0 };		//連撃数
		int32		m_n_max_chain_2p { 0 };		//
		int32		m_n_max_damege_1p { 0 };		//最大連撃力
		int32		m_n_max_damege_2p { 0 };		//


	public:
		Prm_Result ();
		Prm_Result ( const Prm_Result & rhs );	//コピー可能
		~Prm_Result ();

		//すべて読込
		void Load ();

		void Reset ();
	};


}	//namespace GAME

