//=================================================================================================
//
//	SoundGenerate
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Generator.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{

	class SoundGenerate : public Generator
	{
	public:
		SoundGenerate ();
		SoundGenerate ( const SoundGenerate & rhs )	//コピー可能
		{
			(void)rhs;
		}
		~SoundGenerate ();

		void Load ();
	};

	using P_SndGnrt = std::shared_ptr < SoundGenerate >;
	using AP_SndGnrt = s3d::Array < P_SndGnrt >;
	using PAP_SndGnrt = std::shared_ptr < AP_SndGnrt >;


}	//namespace GAME

